Revit 2027 API
MEPSection Properties
The MEPSection type exposes the following members.
Properties
Name | Description
FixtureUnit |  The fixture unit of the section.
Flow |  The flow of the section.
Friction |  The friction of the section.
FrictionFactor |  The friction factor of the section.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Number |  The Section number.
ReynoldsNumber |  The Reynolds number of the section.
Roughness |  The roughness of the section.
TotalCoefficient |  The loss coefficient of the section.
TotalCurveLength |  The total length of all segments in the section.
TotalPressureLoss |  The total pressure loss of the section.
Velocity |  The velocity of the section.
VelocityPressure |  The velocity pressure of the section.
Top
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace